app/controllers/todayitems_controller.rb

  def index
    @todayitems = Todayitem.all
---
SELECT "todayitems".* FROM "todayitems"

  def create
    @todayitem = Todayitem.new(todayitem_params)

    respond_to do |format|
      if @todayitem.save
---
INSERT INTO "todayitems" ("name", "calorie", "tdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Veg Biriyani"], ["calorie", 400], ["tdate", "2016-07-06"], ["created_at", "2016-07-06 17:54:16.742586"], ["updated_at", "2016-07-06 17:54:16.742586"]]

  def destroy
    @todayitem.destroy
---
DELETE FROM "todayitems" WHERE "todayitems"."id" = ?  [["id", 1]]

    def set_todayitem
      @todayitem = Todayitem.find(params[:id])
---
SELECT  "todayitems".* FROM "todayitems" WHERE "todayitems"."id" = ? LIMIT 1  [["id", 1]]